# 记录数据
my_dict = {
    "王力宏": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1
    },
    "周杰伦": {
        "部门": "市场部",
        "工资": 5000,
        "级别": 2
    },
    "林俊杰": {
        "部门": "市场部",
        "工资": 7000,
        "级别": 3
    },
    "张学友": {
        "部门": "科技部",
        '工资': 4000,
        "级别": 1
    },
    "刘德华": {
        "部门": "市场部",
        '工资': 6000,
        "级别": 2
    }
}
print(f"前字典：{my_dict}")
# 加薪筛选
for name in my_dict:
    if my_dict[name]["级别"] == 1:
        my_dict1 = my_dict[name]
        my_dict1["级别"] = 2
        my_dict1["工资"] += 1000
        my_dict[name] = my_dict1
print(f"后字典：{my_dict}")
